package seeder

import (
	"github.com/lib/pq"
	"gorm.io/gorm"
)

func seedGenres(db *gorm.DB) error {
	genres := []string{
		"Арт",
		"Безумие",
		"Боевик",
		"Боевые искусства",
		"Вампиры",
		"Военное",
		"Гарем",
		"Гендерная интрига",
		"Героическое фэнтези",
		"Демоны",
		"Детектив",
		"Детское",
		"Дзёсэй",
		"Драма",
		"Игра",
		"Исекай",
		"История",
		"Киберпанк",
		"Кодомо",
		"Комедия",
		"Космос",
		"Магия",
		"Махо-сёдзё",
		"Машины",
		"Меха",
		"Мистика",
		"Музыка",
		"Научная фантастика",
		"Омегаверс",
		"Пародия",
		"Повседневность",
		"Полиция",
		"Постапокалиптика",
		"Приключения",
		"Психология",
		"Романтика",
		"Самурайский боевик",
		"Сверхъестественное",
		"Сёдзё",
		"Сёдзё-ай",
		"Сёнэн",
		"Сёнэн-ай",
		"Спорт",
		"Супер сила",
		"Сэйнэн",
		"Трагедия",
		"Триллер",
		"Ужасы",
		"Фантастика",
		"Фэнтези",
		"Школа",
		"Этти",
		"Юри",
	}

	return db.Exec("INSERT INTO genres (name) VALUES (UNNEST(?::TEXT[])) ON CONFLICT (lower(name)) DO NOTHING", pq.Array(genres)).Error
}
